Tekla Open API Reference for Tekla Structures 2025
AnalysisDesignParameter Constructor
Overload List
Name | Description
AnalysisDesignParameter(Int32)
 Initializes a new instance of the AnalysisDesignParameter class.
AnalysisDesignParameter(String, Int32, Identifier, Double)
 Initializes a new instance of the AnalysisDesignParameter class.
Top
See Also
Reference
AnalysisDesignParameter Class
Tekla.Structures.Analysis Namespace